In [2]:
import numpy as np
import pandas as pd
from io import StringIO

In [8]:

type(jsondf)
jsondf

              name  age  height                job
0        Fiona Lee   45     198             Doctor
1       Ian Taylor   22     198            Teacher
2    Jasmine Clark   54     165    Project Manager
3      Fiona Brown   27     180            Teacher
4    Charlie Clark   48     157     Data Scientist
..             ...  ...     ...                ...
95     Fiona Clark   41     175  Software Engineer
96    George Clark   50     152     Content Writer
97       Ian Davis   51     153  Marketing Manager
98    Bob Williams   35     183     Data Scientist
99  Ethan Anderson   45     154  Marketing Manager

[100 rows x 4 columns]

In [13]:
jsondf

              name  age  height                job
0        Fiona Lee   45     198             Doctor
1       Ian Taylor   22     198            Teacher
2    Jasmine Clark   54     165    Project Manager
3      Fiona Brown   27     180            Teacher
4    Charlie Clark   48     157     Data Scientist
..             ...  ...     ...                ...
95     Fiona Clark   41     175  Software Engineer
96    George Clark   50     152     Content Writer
97       Ian Davis   51     153  Marketing Manager
98    Bob Williams   35     183     Data Scientist
99  Ethan Anderson   45     154  Marketing Manager

[100 rows x 4 columns]

In [34]:
jsonData

'{"name": "Alice Johnson","age": 28,"height": 165,"job": "Software Engineer"}'

In [38]:
jsonData='{"name": "Alice Johnson","age": 28,"height": 165,"job": "Software Engineer"}'

In [40]:
pd.read_json(StringIO(jsonData),orient='index')

                        0
name        Alice Johnson
age                    28
height                165
job     Software Engineer

In [45]:
jsonData

NameError: name 'jsonData' is not defined

In [3]:
df = pd.DataFrame([['a','b'],['c','d']],index=['row1','row2'],columns=['col1','col2'])

In [4]:
df

     col1 col2
row1    a    b
row2    c    d

In [11]:
df2 = pd.DataFrame([['hariom','gaurisha','shreesha'],['maths','science','physics'],['cse','ai','ml']],index=['row1','row2','row3'],columns=['col1','col2','col3'])

In [12]:
df2

        col1      col2      col3
row1  hariom  gaurisha  shreesha
row2   maths   science   physics
row3     cse        ai        ml

In [14]:
df2.to_json()

'{"col1":{"row1":"hariom","row2":"maths","row3":"cse"},"col2":{"row1":"gaurisha","row2":"science","row3":"ai"},"col3":{"row1":"shreesha","row2":"physics","row3":"ml"}}'

In [15]:
df2.to_json(orient='index')

'{"row1":{"col1":"hariom","col2":"gaurisha","col3":"shreesha"},"row2":{"col1":"maths","col2":"science","col3":"physics"},"row3":{"col1":"cse","col2":"ai","col3":"ml"}}'

In [16]:
df2.to_json(orient='columns')

'{"col1":{"row1":"hariom","row2":"maths","row3":"cse"},"col2":{"row1":"gaurisha","row2":"science","row3":"ai"},"col3":{"row1":"shreesha","row2":"physics","row3":"ml"}}'

In [17]:
df2.to_json(orient='records')

'[{"col1":"hariom","col2":"gaurisha","col3":"shreesha"},{"col1":"maths","col2":"science","col3":"physics"},{"col1":"cse","col2":"ai","col3":"ml"}]'

In [18]:
df2.to_json(orient='split')

'{"columns":["col1","col2","col3"],"index":["row1","row2","row3"],"data":[["hariom","gaurisha","shreesha"],["maths","science","physics"],["cse","ai","ml"]]}'

In [19]:
df2['col1'] = 'name1'

In [20]:
df2

       col1      col2      col3
row1  name1  gaurisha  shreesha
row2  name1   science   physics
row3  name1        ai        ml

In [22]:
df2['col1','row1'] = 'hariom'

In [23]:
df2

        col1      col2      col3 (col1, row1)
row1  hariom  gaurisha  shreesha       hariom
row2   name1   science   physics       hariom
row3   name1        ai        ml       hariom

In [44]:
df2 = df2.drop(df2.columns[3:4])

In [25]:
df2

        col1      col2      col3 (col1, row1)
row1  hariom  gaurisha  shreesha       hariom
row2   name1   science   physics       hariom
row3   name1        ai        ml       hariom

In [27]:
df2 = df2.drop(df2.columns[3:4],axis=1)

In [28]:
df2

        col1      col2      col3
row1  hariom  gaurisha  shreesha
row2   name1   science   physics
row3   name1        ai        ml

In [29]:
df2['col1','row2'] = 'maths'

In [30]:
df2

        col1      col2      col3 (col1, row2)
row1  hariom  gaurisha  shreesha        maths
row2   name1   science   physics        maths
row3   name1        ai        ml        maths

In [31]:
df2 = df2.drop(df2.columns[3:4],axis=1)

In [32]:
df2

        col1      col2      col3
row1  hariom  gaurisha  shreesha
row2   name1   science   physics
row3   name1        ai        ml

In [33]:
df2['row1':'col1']

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [34]:
df2

        col1      col2      col3
row1  hariom  gaurisha  shreesha
row2   name1   science   physics
row3   name1        ai        ml

In [35]:
df2.iloc[1,1] = 'maths'

In [36]:
df2

        col1      col2      col3
row1  hariom  gaurisha  shreesha
row2   name1     maths   physics
row3   name1        ai        ml

In [37]:
df2.iloc[1,0] = 'cse'

In [38]:
df2

        col1      col2      col3
row1  hariom  gaurisha  shreesha
row2     cse     maths   physics
row3   name1        ai        ml

In [39]:
df2.iloc[2,0] = 'ds'

In [40]:
df2

        col1      col2      col3
row1  hariom  gaurisha  shreesha
row2     cse     maths   physics
row3      ds        ai        ml

In [43]:
jsonData

NameError: name 'jsonData' is not defined

In [46]:
df2

        col1      col2      col3
row1  hariom  gaurisha  shreesha
row2     cse     maths   physics
row3      ds        ai        ml

In [47]:
jsonData = df2.to_json()

In [48]:
jsonData

'{"col1":{"row1":"hariom","row2":"cse","row3":"ds"},"col2":{"row1":"gaurisha","row2":"maths","row3":"ai"},"col3":{"row1":"shreesha","row2":"physics","row3":"ml"}}'

In [57]:
jsondata2 = [
    {
        "col1": {
            "row1": "hariom",
            "row2": "cse",
            "row3": "ds",
            "jobProfile": {
                "role1": "sde",
                "role2": "sde2"
            }
        }
    },
    {
        "col2": {
            "row1": "gaurisha",
            "row2": "maths",
            "row3": "ai",
            "jobProfile": {
                "role1": "sde",
                "role2": "sde2"
            }
        }
    },
    {
        "col3": {
            "row1": "shreesha",
            "row2": "physics",
            "row3": "ml",
            "jobProfile": {
                "role1": "sde",
                "role2": "sde2"
            }
        }
    }
]

In [58]:
jsondata2

[{'col1': {'row1': 'hariom',
   'row2': 'cse',
   'row3': 'ds',
   'jobProfile': {'role1': 'sde', 'role2': 'sde2'}}},
 {'col2': {'row1': 'gaurisha',
   'row2': 'maths',
   'row3': 'ai',
   'jobProfile': {'role1': 'sde', 'role2': 'sde2'}}},
 {'col3': {'row1': 'shreesha',
   'row2': 'physics',
   'row3': 'ml',
   'jobProfile': {'role1': 'sde', 'role2': 'sde2'}}}]

In [53]:
df2

        col1      col2      col3
row1  hariom  gaurisha  shreesha
row2     cse     maths   physics
row3      ds        ai        ml

In [60]:
type(jsondata2)

list

In [61]:
data3 = pd.json_normalize(jsondata2)

In [62]:
data3

,col1.row1,col1.row2,col1.row3,col1.jobProfile.role1,col1.jobProfile.role2,col2.row1,col2.row2,col2.row3,col2.jobProfile.role1,col2.jobProfile.role2,col3.row1,col3.row2,col3.row3,col3.jobProfile.role1,col3.jobProfile.role2
0,hariom,cse,ds,sde,sde2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,gaurisha,maths,ai,sde,sde2,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,shreesha,physics,ml,sde,sde2

In [63]:
jsondata2

[{'col1': {'row1': 'hariom',
   'row2': 'cse',
   'row3': 'ds',
   'jobProfile': {'role1': 'sde', 'role2': 'sde2'}}},
 {'col2': {'row1': 'gaurisha',
   'row2': 'maths',
   'row3': 'ai',
   'jobProfile': {'role1': 'sde', 'role2': 'sde2'}}},
 {'col3': {'row1': 'shreesha',
   'row2': 'physics',
   'row3': 'ml',
   'jobProfile': {'role1': 'sde', 'role2': 'sde2'}}}]

In [67]:
newjsondata = [
  {
    "row1": {
      "col1": "hariom",
      "col2": "cse",
      "col3": "ds",
      "jobProfile": {
        "role1": "sde",
        "role2": "sde2"
      }
    }
  },
  {
    "row2": {
      "col1": "gaurisha",
      "col2": "maths",
      "col3": "ai",
      "jobProfile": {
        "role1": "sde",
        "role2": "sde2"
      }
    }
  },
  {
    "row3": {
      "col1": "shreesha",
      "col2": "physics",
      "col3": "ml",
      "jobProfile": {
        "role1": "sde",
        "role2": "sde2"
      }
    }
  }
]

In [68]:
newjsondata

[{'row1': {'col1': 'hariom',
   'col2': 'cse',
   'col3': 'ds',
   'jobProfile': {'role1': 'sde', 'role2': 'sde2'}}},
 {'row2': {'col1': 'gaurisha',
   'col2': 'maths',
   'col3': 'ai',
   'jobProfile': {'role1': 'sde', 'role2': 'sde2'}}},
 {'row3': {'col1': 'shreesha',
   'col2': 'physics',
   'col3': 'ml',
   'jobProfile': {'role1': 'sde', 'role2': 'sde2'}}}]

In [69]:
normaldata = pd.json_normalize(newjsondata)

In [70]:
normaldata

,row1.col1,row1.col2,row1.col3,row1.jobProfile.role1,row1.jobProfile.role2,row2.col1,row2.col2,row2.col3,row2.jobProfile.role1,row2.jobProfile.role2,row3.col1,row3.col2,row3.col3,row3.jobProfile.role1,row3.jobProfile.role2
0,hariom,cse,ds,sde,sde2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,gaurisha,maths,ai,sde,sde2,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,shreesha,physics,ml,sde,sde2

In [71]:
realjsondata = [
  {
    "id": 1,
    "name": "Cole Volk",
    "fitness": {
      "height": 130,
      "weight": 60
    }
  },
  {
    "name": "Mark Reg",
    "fitness": {
      "height": 130,
      "weight": 60
    }
  },
  {
    "id": 2,
    "name": "Faye Raker",
    "fitness": {
      "height": 130,
      "weight": 60
    }
  }
]

In [72]:
realjsondata

[{'id': 1, 'name': 'Cole Volk', 'fitness': {'height': 130, 'weight': 60}},
 {'name': 'Mark Reg', 'fitness': {'height': 130, 'weight': 60}},
 {'id': 2, 'name': 'Faye Raker', 'fitness': {'height': 130, 'weight': 60}}]

In [81]:
normaldata = pd.json_normalize(realjsondata,max_level=1)

In [79]:
normaldata

    id        name  fitness.height  fitness.weight
0  1.0   Cole Volk             130              60
1  NaN    Mark Reg             130              60
2  2.0  Faye Raker             130              60